In [86]:
import numpy as np
import pandas as pd

In [100]:
PRESTITO = 40_000.0
ANNI = 5
TAN = 0.04

In [101]:
# Ammortamento all'italiana
numero_rate = ANNI * 12
quota_capitale = round(PRESTITO / numero_rate)
capitale_residuo = PRESTITO

quote_capitale = []
quote_interessi = []

for i in range(numero_rate):
    quote_interessi.append(round(capitale_residuo * TAN / 12))
    capitale_residuo -= quota_capitale
    quote_capitale.append(quota_capitale)
    

df = pd.DataFrame({
    'quote_capitale': quote_capitale,
    'quote_interessi': quote_interessi
})
df['rate'] = df['quote_capitale'] + df['quote_interessi']
df['capitale_residuo'] = (PRESTITO - df['quote_capitale'].cumsum()).round()

In [102]:
display(df.head())
display(df.tail())

   quote_capitale  quote_interessi  rate  capitale_residuo
0             667              133   800           39333.0
1             667              131   798           38666.0
2             667              129   796           37999.0
3             667              127   794           37332.0
4             667              124   791           36665.0

    quote_capitale  quote_interessi  rate  capitale_residuo
55             667               11   678            2648.0
56             667                9   676            1981.0
57             667                7   674            1314.0
58             667                4   671             647.0
59             667                2   669             -20.0

In [103]:
df.sum()

quote_capitale        40020.0
quote_interessi        4065.0
rate                  44085.0
capitale_residuo    1179390.0
dtype: float64